---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.WallsOverlap
source: html/8688de5f-6398-1ee2-adc2-9b7f8b7f1edc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.WallsOverlap Property

Walls overlap. Consider embedding walls, editing their extents or profile to avoid overlapping.

## Syntax (C#)
```csharp
public static FailureDefinitionId WallsOverlap { get; }
```